# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [2]:
import pandas as pd
import sqlite3
import warnings
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [3]:
import sqlite3
connection = sqlite3.connect("../../go_sales.sqlite")

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [4]:
def execute_query(query: str):
    cur = connection.cursor()
    return cur.execute(query).fetchall()

execute_query("SELECT * FROM product")
execute_query("SELECT * FROM product_type")
execute_query("SELECT * FROM product_line")
execute_query("SELECT * FROM sales_staff")
execute_query("SELECT * FROM sales_branch")
execute_query("SELECT * FROM retailer_site")
execute_query("SELECT * FROM country")
execute_query("SELECT * FROM order_header")
execute_query("SELECT * FROM order_details")
execute_query("SELECT * FROM returned_item")
execute_query("SELECT * FROM return_reason")

[(1, 'Defective product'),
 (2, 'Incomplete product'),
 (3, 'Wrong product ordered'),
 (4, 'Wrong product shipped'),
 (5, 'Unsatisfactory product')]

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [ ]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, ...)
#Op de puntjes hoort de connectie naar go_sales óf go_staff óf go_crm te staan.

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [7]:
pd.read_sql_query("SELECT product_name, PRODUCTION_COST FROM product WHERE PRODUCTION_COST < 100 AND PRODUCTION_COST > 50", connection)

                       PRODUCT_NAME  PRODUCTION_COST
0         TrailChef Deluxe Cook Set            85.11
1            TrailChef Double Flame            75.00
2                   Hibernator Lite            60.00
3                        Hibernator            86.00
4   Hibernator Self - Inflating Mat            78.55
5               Hibernator Camp Cot            65.33
6      Canyon Mule Climber Backpack            62.50
7           Granite Climbing Helmet            52.86
8             Husky Harness Extreme            55.00
9                    Granite Hammer            57.13
10                        Polar Ice            73.33
11                     Polar Sports            80.00
12                       Polar Wave            60.00
13                    Polar Extreme            72.50
14                     Edge Extreme            80.00
15                        Seeker 35            79.19
16                        Seeker 50            92.58
17                   Seeker Extreme            94.12
18                   Glacier Deluxe            56.25
19                      Glacier GPS            78.55
20                Blue Steel Putter            60.00
21            Blue Steel Max Putter            81.80
22              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [15]:
import pandas as pd
pd.read_sql_query("SELECT * FROM product WHERE margin < 0.20 OR margin > 0.60", connection)

,PRODUCT_NUMBER,INTRODUCTION_DATE,PRODUCT_TYPE_CODE,PRODUCTION_COST,MARGIN,PRODUCT_IMAGE,LANGUAGE,PRODUCT_NAME,DESCRIPTION
0,21,1995-02-15,3,29.17,0.17,P21CE1SB3.jpg,EN,Hibernator Pad,Warms up quickly for snow camping comfort. The...
1,24,1997-03-05,4,62.50,0.17,P24CE1PK4.jpg,EN,Canyon Mule Climber Backpack,This pack is perfect for day trips and short h...
2,86,1995-02-15,15,2.00,0.67,P86OP4IR15.jpg,EN,BugShield Natural,"Contains no chemicals. Repels mosquitoes, blac..."
3,87,1995-02-15,15,2.00,0.67,P86OP4IR15.jpg,EN,BugShield Spray,"Repels black flies, ticks, mosquitoes, chigger..."
4,88,1995-02-15,15,2.00,0.70,P86OP4IR15.jpg,EN,BugShield Lotion Lite,"Repels black flies, ticks, mosquitoes, chigger..."
5,89,1995-02-15,15,2.50,0.63,P86OP4IR15.jpg,EN,BugShield Lotion,"Repels black flies, ticks, mosquitoes, chigger..."
6,90,1995-02-15,15,2.50,0.63,P86OP4IR15.jpg,EN,BugShield Extreme,"Highest amount of the active ingredient, 38%, ..."

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [8]:
pd.read_sql_query("SELECT country FROM country WHERE currency_name = 'francs'", connection)

       COUNTRY
0       France
1  Switzerland
2      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [17]:
pd.read_sql_query(
    "SELECT DISTINCT(INTRODUCTION_DATE) FROM product WHERE margin > 0.50", connection)

  INTRODUCTION_DATE
0        2000-10-26
1        1995-02-15
2        2003-12-10
3        2003-12-18
4        2003-12-27
5        2004-01-13
6        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [11]:
pd.read_sql_query("SELECT address1, city FROM sales_branch WHERE address2 IS NOT NULL AND REGION IS NOT NULL", connection)

                           ADDRESS1              CITY
0               Singelgravenplein 4         Amsterdam
1  Prol. Paseo de la Reforma No. 51  Distrito Federal
2               202-2-3 Hyakunincho             Tokyo
3                     543-225 Asahi        Osaka City
4                  2315 Queen's Ave         Melbourne
5             Avenida Paulista, 333         São Paulo
6                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [24]:
pd.read_sql_query(
    "SELECT * FROM country WHERE CURRENCY_NAME LIKE \"%dollar%\" ORDER BY COUNTRY", connection)

   COUNTRY_CODE        COUNTRY LANGUAGE CURRENCY_NAME
0            16      Australia       EN       dollars
1             4         Canada       EN       dollars
2            12         Taiwan       EN    new dollar
3             3  United States       EN       dollars

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [31]:
pd.read_sql_query(
    "SELECT ADDRESS1, CITY FROM sales_branch WHERE POSTAL_ZONE LIKE \"D%\"", connection)

           ADDRESS1     CITY
0    Schwabentor 35  Hamburg
1  Leopoldstraße 36  München

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [13]:
pd.read_sql_query("SELECT COUNT(*) as returned_item_count FROM returned_item", connection)

   returned_item_count
0                  619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [67]:
pd.read_sql_query("SELECT COUNT(DISTINCT(region)) FROM sales_branch", connection)

   COUNT(DISTINCT(region))
0                       15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [ ]:
result = pd.read_sql_query( # type: ignore
    "SELECT MIN(MARGIN), AVG(MARGIN), MAX(MARGIN) FROM product", connection)

laagste = int(result.loc[0, "MIN(MARGIN)"]*100); # type: ignore
hoogste = int(result.loc[0, "MAX(MARGIN)"]*100); # type: ignore
gemiddelde = round(float(result.loc[0, "AVG(MARGIN)"]*100), 2); # type: ignore
laagste, hoogste, gemiddelde

(17, 70, 39.66)

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [ ]:
pd.read_sql_query("SELECT COUNT(*) FROM retailer_site WHERE address2 IS NULL ORDER BY retailer_site_code", connection)

     COUNT(*)
0           1
1           1
2           1
3           1
4           1
..        ...
281         1
282         1
283         1
284         1
285         1

[286 rows x 1 columns]

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [ ]:
pd.read_sql_query("SELECT AVG(unit_cost) FROM order_details WHERE unit_sale_price < unit_price", connection)

   AVG(unit_cost)
0      127.340879

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [51]:
pd.read_sql_query(
    "SELECT POSITION_EN, COUNT(*) FROM sales_staff GROUP BY POSITION_EN", connection)

                    POSITION_EN  COUNT(*)
0                Branch Manager        19
1              District Manager         4
2               General Manager         1
3  Level 1 Sales Representative        13
4  Level 2 Sales Representative        39
5  Level 3 Sales Representative        24
6              Regional Manager         2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [21]:
pd.read_sql_query("SELECT work_phone, COUNT(*) as aantal_medewerkers_bereikbaar FROM sales_staff GROUP BY work_phone HAVING COUNT(*) > 4", connection)

            WORK_PHONE  aantal_medewerkers_bereikbaar
0    +(44) 121 3505267                              5
1  +(61) 03 2982  4242                              5
2  +31 (0)20 692 93 94                              5
3    +33 1 68 94 52 20                              5
4     1 (206) 292-0012                              5
5     1 (305) 557-4810                              6
6     1 (310) 281-5722                              5
7     1 (403) 232-5986                              5
8     1 (416) 493-5595                              5
9     1 (617) 268-6754                              6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [62]:
pd.read_sql_query(
    "SELECT ADDRESS1, CITY FROM retailer_site JOIN country ON retailer_site.COUNTRY_CODE = country.COUNTRY_CODE WHERE COUNTRY = \"Netherlands\"", connection)

                     ADDRESS1          CITY
0      Amsterdamsestraatweg 8      Maarssen
1                    Beets 36         Beets
2                Duivendaal 1    Wageningen
3             Gooiergracht 91         Laren
4               Havenbuurt 12        Marken
5               Hogehilweg 13     Amsterdam
6             Hoofdstraat 150   Pieterburen
7              Kalfjeslaan 47    Amstelveen
8         Krayenhoffstraat 11     Amsterdam
9   Laan van Meerdervoort 966      Den Haag
10      Noorderspoorsingel 28     Groningen
11                Olde Diek 2         Laren
12         Overschiestraat 19     Amsterdam
13               Perestraat 1      Deventer
14             Spoorstraat 43    Varsseveld
15         Stadhouderslaan 18     Rotterdam
16               Startbaan 11    Amstelveen
17              Voorstraat 37  Nieuweschans
18             Westhavenweg 8     Amsterdam
19              Westzeedijk 4        Muiden

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [23]:
pd.read_sql_query("SELECT p.product_name FROM product p JOIN product_type pt ON p.product_type_code = pt.product_type_code WHERE pt.product_type_en = 'Eyewear'", connection)

    PRODUCT_NAME
0  Polar Extreme
1      Polar Ice
2   Polar Sports
3      Polar Sun
4     Polar Wave

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [69]:
pd.read_sql_query(
    "SELECT DISTINCT(ADDRESS1), sales_staff.FIRST_NAME, sales_staff.LAST_NAME FROM sales_branch JOIN sales_staff ON sales_branch.SALES_BRANCH_CODE = sales_staff.SALES_BRANCH_CODE JOIN order_header ON order_header.SALES_STAFF_CODE = sales_staff.SALES_STAFF_CODE WHERE sales_staff.POSITION_EN = \"Branch Manager\"", connection)

                ADDRESS1 FIRST_NAME LAST_NAME
0  Avenida Paulista, 333     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [35]:
pd.read_sql_query("SELECT DISTINCT(s.position_en) AS functie, o.order_date FROM sales_staff s LEFT JOIN order_header o ON s.sales_staff_code = o.sales_staff_code WHERE s.position_en LIKE '%Manager%' ORDER BY s.position_en", connection)

            functie  ORDER_DATE
0    Branch Manager         NaN
1    Branch Manager  2024-01-09
2    Branch Manager  2024-03-13
3    Branch Manager  2024-09-09
4  District Manager         NaN
5   General Manager         NaN
6  Regional Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [75]:
pd.read_sql_query("SELECT DISTINCT(PRODUCT_NAME), product_type.PRODUCT_TYPE_EN FROM product JOIN product_type ON product.PRODUCT_TYPE_CODE = product_type.PRODUCT_TYPE_CODE JOIN order_details ON product.product_number = order_details.product_number WHERE order_details.QUANTITY > 750;", connection)

            PRODUCT_NAME    PRODUCT_TYPE_EN
0      BugShield Extreme  Insect Repellents
1               Star Peg              Tents
2  BugShield Lotion Lite  Insect Repellents
3         Sun Shelter 15          Sunscreen
4         Sun Shelter 30          Sunscreen
5        BugShield Spray  Insect Repellents
6              Firefly 2           Lanterns
7       BugShield Lotion  Insect Repellents
8             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [43]:
pd.read_sql_query("SELECT p.product_name FROM product p JOIN order_details o ON p.product_number = o.product_number WHERE(o.unit_price - o.unit_sale_price) / o.unit_price > 0.4 GROUP BY p.product_name", connection)

                   PRODUCT_NAME
0             BugShield Extreme
1              BugShield Lotion
2         BugShield Lotion Lite
3             BugShield Natural
4               BugShield Spray
5  Hailstorm Titanium Woods Set
6                Sun Shelter 15
7                Sun Shelter 30

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [84]:
pd.read_sql_query(
    "SELECT DISTINCT(RETURN_DESCRIPTION_EN) FROM return_reason JOIN returned_item ON returned_item.RETURN_REASON_CODE = return_reason.RETURN_REASON_CODE JOIN order_details ON order_details.ORDER_DETAIL_CODE = returned_item.ORDER_DETAIL_CODE WHERE returned_item.RETURN_QUANTITY/order_details.QUANTITY > 0.9", connection)

    RETURN_DESCRIPTION_EN
0   Wrong product ordered
1   Wrong product shipped
2  Unsatisfactory product

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [68]:
pd.read_sql_query("""
SELECT product_type_code, COUNT (*) AS aantal_producten
FROM product
GROUP BY product_type_code
""", connection)

    PRODUCT_TYPE_CODE  aantal_producten
0                   1                10
1                   2                 6
2                   3                 7
3                   4                 6
4                   5                12
5                   6                 4
6                   7                 4
7                   8                 7
8                   9                 6
9                  10                 5
10                 11                 5
11                 12                 5
12                 13                 4
13                 14                 4
14                 15                 5
15                 16                 5
16                 17                 5
17                 18                 4
18                 19                 4
19                 20                 3
20                 21                 4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [85]:
pd.read_sql_query("""
    SELECT c.COUNTRY, COUNT(*) as aantal_vestigingen
    FROM retailer_site rs
    JOIN country c ON rs.COUNTRY_CODE = c.COUNTRY_CODE
    GROUP BY c.COUNTRY
    ORDER BY c.COUNTRY
""", connection)

           COUNTRY  aantal_vestigingen
0        Australia                  10
1          Austria                  10
2          Belgium                  10
3           Brazil                   1
4           Canada                  31
5            China                  10
6          Denmark                   6
7          Finland                   5
8           France                  29
9          Germany                  32
10           Italy                  12
11           Japan                  25
12           Korea                  10
13          Mexico                  10
14     Netherlands                  20
15           Spain                   9
16          Sweden                  12
17     Switzerland                  13
18          Taiwan                  10
19  United Kingdom                  25
20   United States                 101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

In [86]:
pd.read_sql_query("""
    SELECT
        p.PRODUCT_NUMBER,
        p.PRODUCT_NAME,
        pt.PRODUCT_TYPE_EN,
        SUM(od.QUANTITY) as totaal_verkocht,
        AVG(od.UNIT_SALE_PRICE) as gem_verkoopprijs,
        AVG(od.UNIT_COST) as gem_kostprijs
        FROM product p
        JOIN product_type pt ON p.PRODUCT_TYPE_CODE = pt.PRODUCT_TYPE_CODE
        JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
        WHERE pt.PRODUCT_TYPE_EN = 'Cooking Gear'
        GROUP BY p.PRODUCT_NUMBER, p.PRODUCT_NAME, pt.PRODUCT_TYPE_EN
        ORDER BY totaal_verkocht
""", connection)

,PRODUCT_NUMBER,PRODUCT_NAME,PRODUCT_TYPE_EN,totaal_verkocht,gem_verkoopprijs,gem_kostprijs
0,6,TrailChef Deluxe Cook Set,Cooking Gear,3110,121.217638,88.070394
1,7,TrailChef Single Flame,Cooking Gear,8504,63.827622,47.303844
2,9,TrailChef Kettle,Cooking Gear,8826,12.201235,9.338305
3,5,TrailChef Cook Set,Cooking Gear,10878,51.687926,37.048097
4,8,TrailChef Double Flame,Cooking Gear,12476,132.672882,79.954637
5,10,TrailChef Utensils,Cooking Gear,13776,17.294151,10.490783
6,3,TrailChef Kitchen Kit,Cooking Gear,22206,22.345975,16.555025
7,2,TrailChef Canteen,Cooking Gear,26544,11.979418,9.389861
8,4,TrailChef Cup,Cooking Gear,27418,6.976490,5.113955
9,1,TrailChef Water Bag,Cooking Gear,36738,6.032506,4.125537

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 28 rijen)

In [76]:
pd.read_sql_query("SELECT c.country, b.city AS verkoper, COUNT(r.city) AS klanten FROM country c JOIN sales_branch b ON c.COUNTRY_CODE = b.COUNTRY_CODE JOIN retailer_site r ON c.COUNTRY_CODE = r.COUNTRY_CODE GROUP BY c.country, b.city", connection)

           COUNTRY          verkoper  klanten
0        Australia         Melbourne       10
1          Austria              Wien       10
2          Belgium          Heverlee       10
3           Brazil         São Paulo        1
4           Canada           Calgary       31
5           Canada           Toronto       31
6            China          Shanghai       10
7          Finland            Kuopio        5
8           France              Lyon       29
9           France             Paris       29
10         Germany           Hamburg       32
11         Germany           München       32
12           Italy            Milano       12
13           Japan        Osaka City       25
14           Japan             Tokyo       25
15           Korea             Seoul       10
16          Mexico  Distrito Federal       10
17     Netherlands         Amsterdam       20
18           Spain            Bilbao        9
19          Sweden             Kista       12
20     Switzerland            Zürich       13
21          Taiwan         San Chung       10
22  United Kingdom        Birmingham       25
23  United Kingdom            London       25
24   United States            Boston      101
25   United States       Los Angeles      101
26   United States             Miami      101
27   United States           Seattle      101

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [88]:
pd.read_sql_query("""
    SELECT FIRST_NAME, LAST_NAME
    FROM sales_staff
    WHERE SALES_STAFF_CODE NOT IN (
        SELECT SALES_STAFF_CODE FROM order_header
    )
""", connection)

   FIRST_NAME      LAST_NAME
0       Denis           Pagé
1        Else         Mörike
2       Frank          Fuchs
3       Fritz         Hirsch
4        Jörg          Kunze
5       Maria      Iacobucci
6        Kick        Kalkman
7       Karin      Bergström
8       Sally          White
9       Frank        Bretton
10    Georges  Saint-Germain
11       Alex      Rodriguez
12   Samantha          Floyd
13      Julie          Olsen
14      Corey         Wright
15    Estelle        Johnson
16       Greg        Belding
17      Julie        Béchard
18      Lucía          Reyna
19     Kazumi        Uragome
20      Alice         Walter
21     Walter         Taylor
22   Penelope        Tamrine
23      Polly         Linton
24      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (2 kolom, 1 rijen)

In [78]:
pd.read_sql_query("SELECT COUNT(*) AS aantal_producten, AVG(margin) AS gemiddelde_margin FROM product WHERE margin < (SELECT AVG(margin) FROM product)", connection)

   aantal_producten  gemiddelde_margin
0                59           0.292203

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [104]:
pd.read_sql_query("""
    SELECT DISTINCT p.PRODUCT_NAME
    FROM product p
    JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
    WHERE od.UNIT_SALE_PRICE > 500
    AND od.ORDER_DETAIL_CODE NOT IN (
        SELECT ri.ORDER_DETAIL_CODE
        FROM returned_item ri
    )
""", connection)

                         PRODUCT_NAME
0                           Star Dome
1                        Star Gazer 2
2                        Star Gazer 3
3                        Star Gazer 6
4               Hailstorm Steel Irons
5            Hailstorm Titanium Irons
6          Lady Hailstorm Steel Irons
7       Lady Hailstorm Titanium Irons
8        Hailstorm Titanium Woods Set
9           Hailstorm Steel Woods Set
10  Lady Hailstorm Titanium Woods Set
11     Lady Hailstorm Steel Woods Set
12                     Husky Rope 200

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [79]:
pd.read_sql_query("SELECT last_name, 'JA' FROM sales_staff WHERE position_en LIKE '%Manager%' UNION SELECT last_name, 'NEE' FROM sales_staff WHERE position_en NOT LIKE '%Manager%'", connection)

      LAST_NAME 'JA'
0     Allessori  NEE
1        Barros  NEE
2       Belding   JA
3     Bergström   JA
4       Bretton   JA
..          ...  ...
97    Wiesinger  NEE
98       Wilcox  NEE
99   Willoughby  NEE
100     Winkler  NEE
101      Wright   JA

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [80]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [81]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [85]:
pd.read_sql_query("""
SELECT
    date_hired,
    CASE
        WHEN (strftime('%Y', 'now') - strftime('%Y', date_hired)) >= 30
        THEN 'lang in dienst'
        ELSE 'kort in dienst'
    END AS status
FROM sales_staff
""", connection)

     DATE_HIRED          status
0    1996-11-03  lang in dienst
1    1995-06-08  lang in dienst
2    1998-04-07  kort in dienst
3    1997-08-16  kort in dienst
4    1997-02-27  kort in dienst
..          ...             ...
97   1999-11-15  kort in dienst
98   1999-12-01  kort in dienst
99   1999-12-09  kort in dienst
100  1998-10-28  kort in dienst
101  1998-02-18  kort in dienst

[102 rows x 2 columns]